In [1]:
import sys

In [2]:
sys.version_info

sys.version_info(major=3, minor=7, micro=3, releaselevel='final', serial=0)

In [3]:
if sys.platform == 'darwin' :
    print(" Mac OS")
else :
    print(" Windows ")

 Mac OS

In [4]:
import pandas as pd

In [5]:
import numpy as np

# 1. 그룹화 처리

     특정 열의 값들을 범주화해서 분리하고 이를 기준으로 계산한 집계를 표시할 수 있습니다.
     
     집계 계산도 특정 열 단위로 처리도 가능합니다.

## 그룹화 처리기준 : 분할, 적용, 조합 

         - 분할 : 특정 값별로 분리
         - 적용 : 분할된 것별로 특정 함수나 메소드 처리
         - 조합 : 적용된 것을 합하기

### 시본 데이터 가져오기

In [6]:
import seaborn as sns

In [7]:
tips = sns.load_dataset("tips")

In [8]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [9]:
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [10]:
tips.ndim

2

In [11]:
tips.shape

(244, 7)

## 1-1 특정 열을 기준으로 그룹화

      특정 범주를 지정하면 이 기준이 행의 인덱스가 되고 나머지는 열로 처리됩니다.

### 범주화 값 확인하기

In [12]:
tips.sex.value_counts()

Male      157
Female     87
Name: sex, dtype: int64

### 그룹화 처리

In [13]:
t_gr = tips.groupby('sex')

### 두 개의 범주로 그룹 처리

In [14]:
t_gr.ngroups

2

### 그룹화하면 별로의 클래스의 객체가 생성됩니다.

In [15]:
t_gr

## 1-2 그룹화 객체의 속성 알아보기

In [16]:
t_gr_Male = t_gr.get_group('Male')

In [17]:
type(t_gr_Male)

pandas.core.frame.DataFrame

### 그룹화 내부의 값을 가져오기

In [18]:
t_gr.groups['Male']

Int64Index([  1,   2,   3,   5,   6,   7,   8,   9,  10,  12,
            ...
            231, 232, 233, 234, 235, 236, 237, 239, 241, 242],
           dtype='int64', length=157)

In [19]:
t_gr_Female = t_gr.get_group('Female')

#### 그룹화 처리된 행 인덱스를 확인

In [20]:
type(t_gr_Female)

pandas.core.frame.DataFrame

In [21]:
t_gr.groups['Female']

Int64Index([  0,   4,  11,  14,  16,  18,  21,  22,  29,  32,  33,  37,  51,
             52,  57,  66,  67,  71,  72,  73,  74,  82,  85,  92,  93,  94,
            100, 101, 102, 103, 104, 109, 111, 114, 115, 117, 118, 119, 121,
            124, 125, 127, 128, 131, 132, 133, 134, 135, 136, 137, 139, 140,
            143, 144, 145, 146, 147, 155, 157, 158, 162, 164, 168, 169, 178,
            186, 188, 191, 197, 198, 201, 202, 203, 205, 209, 213, 214, 215,
            219, 221, 223, 225, 226, 229, 238, 240, 243],
           dtype='int64')

### 그룹화 된 결과를 가져오면 튜플로 처리됨

In [22]:
male, female = t_gr

In [23]:
type(male)

tuple

#### 첫번째는 그룹화 기준

In [24]:
male[0]

'Male'

#### 두번째는 그룹화된 결과

In [25]:
male[1][:5]

   total_bill   tip   sex smoker  day    time  size
1       10.34  1.66  Male     No  Sun  Dinner     3
2       21.01  3.50  Male     No  Sun  Dinner     3
3       23.68  3.31  Male     No  Sun  Dinner     2
5       25.29  4.71  Male     No  Sun  Dinner     4
6        8.77  2.00  Male     No  Sun  Dinner     2

#### 그룹화된 기준 확인

In [26]:
for name, group_ in t_gr :
    print("name ", name)

name  Male
name  Female

#### 그룹으로 묶인 개수를 확인할 수 있다.

In [27]:
tips.sex.value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [28]:
t_gr.size()

sex
Male      157
Female     87
dtype: int64

#### 그룹화된 내용을 처리하기

In [29]:
t_gr.get_group("Male").count()

total_bill    157
tip           157
sex           157
smoker        157
day           157
time          157
size          157
dtype: int64

In [30]:
t_gr.get_group("Female").count()

total_bill    87
tip           87
sex           87
smoker        87
day           87
time          87
size          87
dtype: int64

## 1-3 그룹화된 행의 정보를 확인하기

In [31]:
t_gr.get_group('Male').iloc[5]

total_bill     26.88
tip             3.12
sex             Male
smoker            No
day              Sun
time          Dinner
size               4
Name: 7, dtype: object

In [32]:
t_gr.get_group('Female').iloc[5]

total_bill     16.97
tip              3.5
sex           Female
smoker            No
day              Sun
time          Dinner
size               3
Name: 18, dtype: object

In [33]:
t_gr.nth(5)

        total_bill   tip smoker  day    time  size
sex
Male         26.88  3.12     No  Sun  Dinner     4
Female       16.97  3.50     No  Sun  Dinner     3

### 그룹화된 임의의 정보를 가져오기

In [34]:
t_gr.head()

    total_bill   tip     sex smoker  day    time  size
0        16.99  1.01  Female     No  Sun  Dinner     2
1        10.34  1.66    Male     No  Sun  Dinner     3
2        21.01  3.50    Male     No  Sun  Dinner     3
3        23.68  3.31    Male     No  Sun  Dinner     2
4        24.59  3.61  Female     No  Sun  Dinner     4
5        25.29  4.71    Male     No  Sun  Dinner     4
6         8.77  2.00    Male     No  Sun  Dinner     2
11       35.26  5.00  Female     No  Sun  Dinner     4
14       14.83  3.02  Female     No  Sun  Dinner     2
16       10.33  1.67  Female     No  Sun  Dinner     3

In [35]:
t_gr.tail()

     total_bill   tip     sex smoker   day    time  size
226       10.09  2.00  Female    Yes   Fri   Lunch     2
229       22.12  2.88  Female    Yes   Sat  Dinner     2
236       12.60  1.00    Male    Yes   Sat  Dinner     2
237       32.83  1.17    Male    Yes   Sat  Dinner     2
238       35.83  4.67  Female     No   Sat  Dinner     3
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

## 1-4  복수로 그룹화 하기

In [36]:
t_gr_2 = tips.groupby(['sex', 'smoker'])

In [37]:
t_gr_2

###  그룹화된 범주 확인하기

In [38]:
t_gr_2.size()

sex     smoker
Male    Yes       60
        No        97
Female  Yes       33
        No        54
dtype: int64

### 두 개의 열에 대한 그룹정보 가져오기

In [39]:
t_gr_2.groups[('Male','No')]

Int64Index([  1,   2,   3,   5,   6,   7,   8,   9,  10,  12,  13,  15,  17,
             19,  20,  23,  24,  25,  26,  27,  28,  30,  31,  34,  35,  36,
             38,  39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,
             53,  54,  55,  59,  64,  65,  68,  70,  75,  77,  78,  79,  81,
             84,  86,  87,  88,  89,  91,  99, 108, 110, 112, 113, 116, 120,
            122, 123, 126, 129, 130, 141, 142, 148, 149, 150, 151, 152, 153,
            154, 156, 159, 160, 161, 163, 165, 166, 167, 185, 195, 212, 227,
            228, 232, 233, 235, 239, 242],
           dtype='int64')

In [40]:
t_gr_2.get_group(('Male','No')).head()

   total_bill   tip   sex smoker  day    time  size
1       10.34  1.66  Male     No  Sun  Dinner     3
2       21.01  3.50  Male     No  Sun  Dinner     3
3       23.68  3.31  Male     No  Sun  Dinner     2
5       25.29  4.71  Male     No  Sun  Dinner     4
6        8.77  2.00  Male     No  Sun  Dinner     2

In [41]:
t_gr_2.get_group(('Female','No')).head()

    total_bill   tip     sex smoker  day    time  size
0        16.99  1.01  Female     No  Sun  Dinner     2
4        24.59  3.61  Female     No  Sun  Dinner     4
11       35.26  5.00  Female     No  Sun  Dinner     4
14       14.83  3.02  Female     No  Sun  Dinner     2
16       10.33  1.67  Female     No  Sun  Dinner     3

## 2. 그룹화 메소드 비교하기

## 2-1 내부의 값을 계산하기 : agg, aggregate

In [42]:
df_day = tips.groupby('day')

### agg 함수는 시리즈가 인자로 전달됨

       그룹으로 분리(4개) * 각 열(6 개). = 총 24개 시리즈가 전달되어 계산됨

In [43]:
df_day.agg(lambda x: print(type(x)))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

      total_bill  tip   sex smoker  time  size
day
Thur         NaN  NaN  None   None  None  None
Fri          NaN  NaN  None   None  None  None
Sat          NaN  NaN  None   None  None  None
Sun          NaN  NaN  None   None  None  None

### aggregate 메소드와 agg 메소드로 평균 처리

In [44]:
df_day.aggregate('mean')

      total_bill       tip      size
day
Thur   17.682742  2.771452  2.451613
Fri    17.151579  2.734737  2.105263
Sat    20.441379  2.993103  2.517241
Sun    21.410000  3.255132  2.842105

In [45]:
df_day.agg('mean')

      total_bill       tip      size
day
Thur   17.682742  2.771452  2.451613
Fri    17.151579  2.734737  2.105263
Sat    20.441379  2.993103  2.517241
Sun    21.410000  3.255132  2.842105

### 그룹화된 데이터 프레임에 하나의 칼럼에 대한 계산

In [46]:
df_day['total_bill'].aggregate('mean')

day
Thur    17.682742
Fri     17.151579
Sat     20.441379
Sun     21.410000
Name: total_bill, dtype: float64

In [47]:
df_day['total_bill'].mean()

day
Thur    17.682742
Fri     17.151579
Sat     20.441379
Sun     21.410000
Name: total_bill, dtype: float64

## 2-2  그룹화내의 값을 필터링하기 

          필터링을 처리하면 필터링 결과가 참인 경우를 그대로 반환한다.

In [48]:
tips.shape

(244, 7)

### 그룹화한 객체가  람다함수의 인자로 전달된다

In [49]:
df_day.ngroups

4

In [50]:
df_day.filter(lambda x: print(type(x)))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

Empty DataFrame
Columns: [total_bill, tip, sex, smoker, day, time, size]
Index: []

###  필터 조건에 맞는 것만 추출

In [51]:
df_day.filter( lambda x : x['total_bill'].mean() > 20 ).shape

(163, 7)

In [52]:
df_day.filter( lambda x : x['total_bill'].mean()  <= 20 ).shape

(81, 7)

### 필터링한 결과가 데이터프레임으로 반환

In [53]:
df_ft = df_day.filter( lambda x : x['total_bill'].mean()  <= 20 )

In [54]:
df_ft.head()

    total_bill   tip   sex smoker   day   time  size
77       27.20  4.00  Male     No  Thur  Lunch     4
78       22.76  3.00  Male     No  Thur  Lunch     2
79       17.29  2.71  Male     No  Thur  Lunch     2
80       19.44  3.00  Male    Yes  Thur  Lunch     2
81       16.66  3.40  Male     No  Thur  Lunch     2

### 필터링 된 결과에서 칼럼을 선택해서 계산도 가능

In [55]:
df_day.filter( lambda x : x['total_bill'].mean() > 20)['size'].mean()

2.668711656441718

##  2-3  모든 값을 변환하기 : transform

### 모든 시리즈와 한번의 데이터프레임이 전달

In [56]:
df_day.transform(lambda x: print(type(x)))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

    total_bill   tip   sex smoker  time  size
0         None  None  None   None  None  None
1         None  None  None   None  None  None
2         None  None  None   None  None  None
3         None  None  None   None  None  None
4         None  None  None   None  None  None
5         None  None  None   None  None  None
6         None  None  None   None  None  None
7         None  None  None   None  None  None
8         None  None  None   None  None  None
9         None  None  None   None  None  None
10        None  None  None   None  None  None
11        None  None  None   None  None  None
12        None  None  None   None  None  None
13        None  None  None   None  None  None
14        None  None  None   None  None  None
15        None  None  None   None  None  None
16        None  None  None   None  None  None
17        None  None  None   None  None  None
18        None  None  None   None  None  None
19        None  None  None   None  None  None
20        None  None  None   None  None  None
21        None  None  None   None  None  None
22        None  None  None   None  None  None
23        None  None  None   None  None  None
24        None  None  None   None  None  None
25        None  None  None   None  None  None
26        None  None  None   None  None  None
27        None  None  None   None  None  None
28        None  None  None   None  None  None
29        None  None  None   None  None  None
..         ...   ...   ...    ...   ...   ...
214       None  None  None   None  None  None
215       None  None  None   None  None  None
216       None  None  None   None  None  None
217       None  None  None   None  None  None
218       None  None  None   None  None  None
219       None  None  None   None  None  None
220       None  None  None   None  None  None
221       None  None  None   None  None  None
222       None  None  None   None  None  None
223       None  None  None   None  None  None
224       None  None  None   None  None  None
225       None  None  None   None  None  None
226       None  None  None   None  None  None
227       None  None  None   None  None  None
228       None  None  None   None  None  None
229       None  None  None   None  None  None
230       None  None  None   None  None  None
231       None  None  None   None  None  None
232       None  None  None   None  None  None
233       None  None  None   None  None  None
234       None  None  None   None  None  None
235       None  None  None   None  None  None
236       None  None  None   None  None  None
237       None  None  None   None  None  None
238       None  None  None   None  None  None
239       None  None  None   None  None  None
240       None  None  None   None  None  None
241       None  None  None   None  None  None
242       None  None  None   None  None  None
243       None  None  None   None  None  None

[244 rows x 6 columns]

### 평균을 계산하면 수치 값 열만 계산됨, 전부 평균값으로 계산된 것을 알 수 있음

In [57]:
df_day['total_bill'].mean()

day
Thur    17.682742
Fri     17.151579
Sat     20.441379
Sun     21.410000
Name: total_bill, dtype: float64

In [58]:
df_day['tip'].mean()

day
Thur    2.771452
Fri     2.734737
Sat     2.993103
Sun     3.255132
Name: tip, dtype: float64

In [59]:
for i, v  in enumerate(df_day) :
    print(v[0])
    print("===================")
    print(v[1].mean())
    print("===================")

Thur
===================
total_bill    17.682742
tip            2.771452
size           2.451613
dtype: float64
===================
Fri
===================
total_bill    17.151579
tip            2.734737
size           2.105263
dtype: float64
===================
Sat
===================
total_bill    20.441379
tip            2.993103
size           2.517241
dtype: float64
===================
Sun
===================
total_bill    21.410000
tip            3.255132
size           2.842105
dtype: float64
===================

### 모든 값을  그룹화에 맞는 평균값으로 변경

In [60]:
df_day. transform(lambda x : x.mean())

     total_bill       tip      size
0     21.410000  3.255132  2.842105
1     21.410000  3.255132  2.842105
2     21.410000  3.255132  2.842105
3     21.410000  3.255132  2.842105
4     21.410000  3.255132  2.842105
5     21.410000  3.255132  2.842105
6     21.410000  3.255132  2.842105
7     21.410000  3.255132  2.842105
8     21.410000  3.255132  2.842105
9     21.410000  3.255132  2.842105
10    21.410000  3.255132  2.842105
11    21.410000  3.255132  2.842105
12    21.410000  3.255132  2.842105
13    21.410000  3.255132  2.842105
14    21.410000  3.255132  2.842105
15    21.410000  3.255132  2.842105
16    21.410000  3.255132  2.842105
17    21.410000  3.255132  2.842105
18    21.410000  3.255132  2.842105
19    20.441379  2.993103  2.517241
20    20.441379  2.993103  2.517241
21    20.441379  2.993103  2.517241
22    20.441379  2.993103  2.517241
23    20.441379  2.993103  2.517241
24    20.441379  2.993103  2.517241
25    20.441379  2.993103  2.517241
26    20.441379  2.993103  2.517241
27    20.441379  2.993103  2.517241
28    20.441379  2.993103  2.517241
29    20.441379  2.993103  2.517241
..          ...       ...       ...
214   20.441379  2.993103  2.517241
215   20.441379  2.993103  2.517241
216   20.441379  2.993103  2.517241
217   20.441379  2.993103  2.517241
218   20.441379  2.993103  2.517241
219   20.441379  2.993103  2.517241
220   17.151579  2.734737  2.105263
221   17.151579  2.734737  2.105263
222   17.151579  2.734737  2.105263
223   17.151579  2.734737  2.105263
224   17.151579  2.734737  2.105263
225   17.151579  2.734737  2.105263
226   17.151579  2.734737  2.105263
227   20.441379  2.993103  2.517241
228   20.441379  2.993103  2.517241
229   20.441379  2.993103  2.517241
230   20.441379  2.993103  2.517241
231   20.441379  2.993103  2.517241
232   20.441379  2.993103  2.517241
233   20.441379  2.993103  2.517241
234   20.441379  2.993103  2.517241
235   20.441379  2.993103  2.517241
236   20.441379  2.993103  2.517241
237   20.441379  2.993103  2.517241
238   20.441379  2.993103  2.517241
239   20.441379  2.993103  2.517241
240   20.441379  2.993103  2.517241
241   20.441379  2.993103  2.517241
242   20.441379  2.993103  2.517241
243   17.682742  2.771452  2.451613

[244 rows x 3 columns]

###  변형된 값을 별도의 칼럼에 저장해서 처리할 때 사용

In [61]:
tips_day = tips.copy()

In [62]:
tips_day['day_average'] = df_day['total_bill'].transform(lambda x : x.mean())

In [63]:
tips_day.head()

   total_bill   tip     sex smoker  day    time  size  day_average
0       16.99  1.01  Female     No  Sun  Dinner     2        21.41
1       10.34  1.66    Male     No  Sun  Dinner     3        21.41
2       21.01  3.50    Male     No  Sun  Dinner     3        21.41
3       23.68  3.31    Male     No  Sun  Dinner     2        21.41
4       24.59  3.61  Female     No  Sun  Dinner     4        21.41

### 실제 처리된 결과를 특정 요일별로 확인

In [64]:
ss = tips_day[['day', 'day_average']].set_index('day')

In [65]:
ss.drop_duplicates()

      day_average
day
Sun     21.410000
Sat     20.441379
Thur    17.682742
Fri     17.151579

## 2.4  apply  처리

### 시리즈를 그룹화하기

In [66]:
s = pd.Series([[1,2,3,4,5]])

In [67]:
s

0    [1, 2, 3, 4, 5]
dtype: object

In [68]:
sg = s.groupby(level=0)

In [69]:
sg

In [70]:
sg.apply(pd.Series)

0    [1, 2, 3, 4, 5]
Name: 0, dtype: object

### 시리즈를 데이터 프레임으로 변환

In [71]:
df_sg = sg.apply(pd.DataFrame)

In [72]:
df_sg

                 0
0  [1, 2, 3, 4, 5]

### 데이테 프레임 내의 리스트를  칼럼으로 변환

In [73]:
df_lot = df_sg[0].apply(pd.Series)

In [74]:
df_lot

   0  1  2  3  4
0  1  2  3  4  5

### apply 에 전달되는 객체 확인

####  apply에 모든 그룹바이를 처리하면 데이터 프레임으로 전달

In [75]:
df_day

In [76]:
df_day.apply(lambda x: print(type(x)))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

Empty DataFrame
Columns: []
Index: []

####  특정 칼럼을 선택하면  시리즈가 전달

In [77]:
df_day['tip'].apply(lambda x: print(type(x)))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

day
Thur    None
Fri     None
Sat     None
Sun     None
Name: tip, dtype: object